## ğŸ“‚ DataFrame Merge

MergeëŠ” ë‘ ê°œì˜ DataFrameì˜ ê³µí†µ ì—´ ë˜ëŠ” í–‰ ì¸ë±ìŠ¤ë¥¼ ê¸°ì¤€ìœ¼ë¡œ ë³‘í•©í•œë‹¤.<br>
ë³‘í•© ë°©ì‹ìœ¼ë¡œëŠ” inner, outer, left, rightê°€ ì¡´ì¬í•˜ë©° how íŒŒë¼ë¯¸í„°ë¡œ ì •í•  ìˆ˜ ìˆë‹¤.

In [1]:
import numpy as np
import pandas as pd

In [2]:
df1 = pd.DataFrame({
    'ê³ ê°ë²ˆí˜¸':[1001, 1002, 1003, 1004, 1005, 1006, 1007],
    'ì´ë¦„':['ë‘˜ë¦¬', 'ë„ìš°ë„ˆ', 'ë˜ì¹˜', 'ê¸¸ë™', 'í¬ë™', 'ë§ˆì´ì½œ', 'ì˜í¬']
    })
df1

   ê³ ê°ë²ˆí˜¸   ì´ë¦„
0  1001   ë‘˜ë¦¬
1  1002  ë„ìš°ë„ˆ
2  1003   ë˜ì¹˜
3  1004   ê¸¸ë™
4  1005   í¬ë™
5  1006  ë§ˆì´ì½œ
6  1007   ì˜í¬

In [3]:
df2 = pd.DataFrame({
    'ê³ ê°ë²ˆí˜¸':[1001, 1001, 1005, 1006, 1008, 1001],
    'ê¸ˆì•¡':[10000, 20000, 15000, 5000, 100000, 30000]
    })
df2

   ê³ ê°ë²ˆí˜¸      ê¸ˆì•¡
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000

In [4]:
pd.merge(df1, df2, how='left')

   ê³ ê°ë²ˆí˜¸   ì´ë¦„       ê¸ˆì•¡
0  1001   ë‘˜ë¦¬  10000.0
1  1001   ë‘˜ë¦¬  20000.0
2  1001   ë‘˜ë¦¬  30000.0
3  1002  ë„ìš°ë„ˆ      NaN
4  1003   ë˜ì¹˜      NaN
5  1004   ê¸¸ë™      NaN
6  1005   í¬ë™  15000.0
7  1006  ë§ˆì´ì½œ   5000.0
8  1007   ì˜í¬      NaN

In [5]:
pd.merge(df1, df2, how='right')

   ê³ ê°ë²ˆí˜¸   ì´ë¦„      ê¸ˆì•¡
0  1001   ë‘˜ë¦¬   10000
1  1001   ë‘˜ë¦¬   20000
2  1005   í¬ë™   15000
3  1006  ë§ˆì´ì½œ    5000
4  1008  NaN  100000
5  1001   ë‘˜ë¦¬   30000

In [6]:
pd.merge(df1, df2, how='inner')

   ê³ ê°ë²ˆí˜¸   ì´ë¦„     ê¸ˆì•¡
0  1001   ë‘˜ë¦¬  10000
1  1001   ë‘˜ë¦¬  20000
2  1001   ë‘˜ë¦¬  30000
3  1005   í¬ë™  15000
4  1006  ë§ˆì´ì½œ   5000

In [7]:
pd.merge(df1, df2, how='outer')

   ê³ ê°ë²ˆí˜¸   ì´ë¦„        ê¸ˆì•¡
0  1001   ë‘˜ë¦¬   10000.0
1  1001   ë‘˜ë¦¬   20000.0
2  1001   ë‘˜ë¦¬   30000.0
3  1002  ë„ìš°ë„ˆ       NaN
4  1003   ë˜ì¹˜       NaN
5  1004   ê¸¸ë™       NaN
6  1005   í¬ë™   15000.0
7  1006  ë§ˆì´ì½œ    5000.0
8  1007   ì˜í¬       NaN
9  1008  NaN  100000.0

í‚¤ê°€ ê°™ì€ ë°ì´í„°ê°€ ì—¬ëŸ¬ ê°œ ìˆëŠ” ê²½ìš°ì—ëŠ” ìˆì„ ìˆ˜ ìˆëŠ” ëª¨ë“  ê²½ìš°ì˜ ìˆ˜ë¥¼ ë”°ì ¸ì„œ ì¡°í•©ì„ ë§Œë“¤ì–´ë‚¸ë‹¤.

In [8]:
df1 = pd.DataFrame({
    'í’ˆì¢…':['setosa', 'setosa', 'virginica', 'virginica'],
    'ê½ƒìê¸¸ì´':[1.4, 1.3, 1.5, 1.3]
    })
df1

          í’ˆì¢…  ê½ƒìê¸¸ì´
0     setosa   1.4
1     setosa   1.3
2  virginica   1.5
3  virginica   1.3

In [9]:
df2 = pd.DataFrame({
    'í’ˆì¢…':['setosa', 'virginica', 'virginica', 'ersicolor'],
    'ê½ƒìë„ˆë¹„':[0.4, 0.3, 0.5, 0.3]
    })
df2

          í’ˆì¢…  ê½ƒìë„ˆë¹„
0     setosa   0.4
1  virginica   0.3
2  virginica   0.5
3  ersicolor   0.3

In [10]:
pd.merge(df1, df2)

          í’ˆì¢…  ê½ƒìê¸¸ì´  ê½ƒìë„ˆë¹„
0     setosa   1.4   0.4
1     setosa   1.3   0.4
2  virginica   1.5   0.3
3  virginica   1.5   0.5
4  virginica   1.3   0.3
5  virginica   1.3   0.5

ì—´ ì´ë¦„ì´ ì¤‘ë³µë˜ëŠ” ê²½ìš°ì—ëŠ” ëª…ì‹œì ìœ¼ë¡œ on íŒŒë¼ë¯¸í„°ë¥¼ í†µí•´ ê¸°ì¤€ ì—´ì„ ì§€ì •í•  ìˆ˜ ìˆë‹¤.

In [11]:
df1 = pd.DataFrame({
    'ê³ ê°ëª…':['ì¶˜í–¥', 'ì¶˜í–¥', 'ëª½ë£¡'],
    'ë‚ ì§œ':['2018-01-01', '2018-01-02', '2018-01-01'],
    'ë°ì´í„°':[20000, 30000, 100000]
})
df1

  ê³ ê°ëª…          ë‚ ì§œ     ë°ì´í„°
0  ì¶˜í–¥  2018-01-01   20000
1  ì¶˜í–¥  2018-01-02   30000
2  ëª½ë£¡  2018-01-01  100000

In [12]:
df2 = pd.DataFrame({
    'ê³ ê°ëª…':['ì¶˜í–¥', 'ëª½ë£¡'],
    'ë°ì´í„°':['ì—¬ì', 'ë‚¨ì']
    })
df2

  ê³ ê°ëª… ë°ì´í„°
0  ì¶˜í–¥  ì—¬ì
1  ëª½ë£¡  ë‚¨ì

In [13]:
pd.merge(df1, df2, on='ê³ ê°ëª…')

  ê³ ê°ëª…          ë‚ ì§œ   ë°ì´í„°_x ë°ì´í„°_y
0  ì¶˜í–¥  2018-01-01   20000    ì—¬ì
1  ì¶˜í–¥  2018-01-02   30000    ì—¬ì
2  ëª½ë£¡  2018-01-01  100000    ë‚¨ì

ê¸°ì¤€ ì—´ì˜ ì´ë¦„ì´ ë‹¤ë¥¸ ê²½ìš° ì™¼ìª½ ê¸°ì¤€ì—´ì€ left_on íŒŒë¼ë¯¸í„°ë¡œ ì§€ì •í•˜ê³  ì˜¤ë¥¸ìª½ ê¸°ì¤€ì—´ì€ right_on íŒŒë¼ë¯¸í„°ë¡œ ì§€ì •í•  ìˆ˜ ìˆë‹¤.

In [14]:
df1 = pd.DataFrame({
    'ì´ë¦„':['ì˜í¬', 'ì² ìˆ˜', 'ì² ìˆ˜'],
    'ì„±ì ':[90, 80, 80]
})
df1

   ì´ë¦„  ì„±ì
0  ì˜í¬  90
1  ì² ìˆ˜  80
2  ì² ìˆ˜  80

In [15]:
df2 = pd.DataFrame({
    'ì„±ëª…':['ì˜í¬', 'ì˜í¬', 'ì² ìˆ˜'],
    'ì„±ì 2':[100, 80, 90]
})
df2

   ì„±ëª…  ì„±ì 2
0  ì˜í¬  100
1  ì˜í¬   80
2  ì² ìˆ˜   90

In [16]:
pd.merge(df1, df2, left_on='ì´ë¦„', right_on='ì„±ëª…')

   ì´ë¦„  ì„±ì   ì„±ëª…  ì„±ì 2
0  ì˜í¬  90  ì˜í¬  100
1  ì˜í¬  90  ì˜í¬   80
2  ì² ìˆ˜  80  ì² ìˆ˜   90
3  ì² ìˆ˜  80  ì² ìˆ˜   90

ì—´ì´ ì•„ë‹Œ í–‰ ì¸ë±ìŠ¤ë¥¼ ê¸°ì¤€ìœ¼ë¡œ Merge í•˜ë ¤ë©´ íŒŒë¼ë¯¸í„° left_index = True ë˜ëŠ” right_index = True ì„¤ì •ì„ í•˜ë©´ ëœë‹¤.

In [17]:
df1 = pd.DataFrame({
    'ë„ì‹œ': ['ì„œìš¸', 'ì„œìš¸', 'ì„œìš¸', 'ë¶€ì‚°', 'ë¶€ì‚°'],
    'ì—°ë„': [2000, 2005, 2010, 2000, 2005],
    'ì¸êµ¬':[9853972, 9762546, 9631482, 3655437, 3512547]    
    })
df1

   ë„ì‹œ    ì—°ë„       ì¸êµ¬
0  ì„œìš¸  2000  9853972
1  ì„œìš¸  2005  9762546
2  ì„œìš¸  2010  9631482
3  ë¶€ì‚°  2000  3655437
4  ë¶€ì‚°  2005  3512547

In [18]:
df2 = pd.DataFrame(
    np.arange(12).reshape((6,2)),
    index=[['ë¶€ì‚°', 'ë¶€ì‚°', 'ì„œìš¸', 'ì„œìš¸', 'ì„œìš¸', 'ì„œìš¸'],
          [2000, 2005, 2000, 2005, 2010, 2015]],
    columns=['ë°ì´í„°1','ë°ì´í„°2'])
df2

         ë°ì´í„°1  ë°ì´í„°2
ë¶€ì‚° 2000     0     1
   2005     2     3
ì„œìš¸ 2000     4     5
   2005     6     7
   2010     8     9
   2015    10    11

In [19]:
pd.merge(df1, df2, left_on=['ë„ì‹œ', 'ì—°ë„'], right_index=True)

   ë„ì‹œ    ì—°ë„       ì¸êµ¬  ë°ì´í„°1  ë°ì´í„°2
0  ì„œìš¸  2000  9853972     4     5
1  ì„œìš¸  2005  9762546     6     7
2  ì„œìš¸  2010  9631482     8     9
3  ë¶€ì‚°  2000  3655437     0     1
4  ë¶€ì‚°  2005  3512547     2     3

ì–‘ìª½ DataFrame ëª¨ë‘ Keyê°€ í–‰ ì¸ë±ìŠ¤ì¸ ê²½ìš°

In [20]:
df1 = pd.DataFrame(
    [[1., 2.], [3., 4.], [5., 6.]],
    index=['a', 'c', 'e'],
    columns=['ì„œìš¸', 'ë¶€ì‚°'])
df1

    ì„œìš¸   ë¶€ì‚°
a  1.0  2.0
c  3.0  4.0
e  5.0  6.0

In [21]:
df2 = pd.DataFrame(
    [[7., 8.], [9., 10.], [11., 12.], [13., 14.]],
    index=['b', 'c', 'd', 'e'],
    columns=['ëŒ€êµ¬', 'ê´‘ì£¼'])
df2

     ëŒ€êµ¬    ê´‘ì£¼
b   7.0   8.0
c   9.0  10.0
d  11.0  12.0
e  13.0  14.0

In [22]:
pd.merge(df1,df2,left_index=True, right_index=True, how='outer')

    ì„œìš¸   ë¶€ì‚°    ëŒ€êµ¬    ê´‘ì£¼
a  1.0  2.0   NaN   NaN
b  NaN  NaN   7.0   8.0
c  3.0  4.0   9.0  10.0
d  NaN  NaN  11.0  12.0
e  5.0  6.0  13.0  14.0

í–‰ ì¸ë±ìŠ¤ë¥¼ ê¸°ì¤€ìœ¼ë¡œ ë³‘í•©í•  ë•Œì—ëŠ” Merge ëª…ë ¹ì–´ ëŒ€ì‹  Join ëª…ë ¹ì–´ë¥¼ ì‚¬ìš©í•  ìˆ˜ë„ ìˆìœ¼ë©° ì‚¬ìš©ë²•ì€ ë™ì¼í•˜ë‹¤.

In [23]:
df1.join(df2, how='outer')

    ì„œìš¸   ë¶€ì‚°    ëŒ€êµ¬    ê´‘ì£¼
a  1.0  2.0   NaN   NaN
b  NaN  NaN   7.0   8.0
c  3.0  4.0   9.0  10.0
d  NaN  NaN  11.0  12.0
e  5.0  6.0  13.0  14.0

---

## ğŸ“‚ DataFrame Concate

ConcateëŠ” ë‘ ê°œì˜ DataFrameì„ ê¸°ì¤€ ì—´ ì—†ì´ ë³‘í•©í•œë‹¤.<br>
ë‹¨ìˆœíˆ ë‘ Series ë˜ëŠ” DataFrameì„ ë³‘í•©í•˜ê¸° ë•Œë¬¸ì— ì¸ë±ìŠ¤ê°€ ì¤‘ë³µë  ìˆ˜ë„ ìˆë‹¤.

In [24]:
df1 = pd.DataFrame({'A':['A0', 'A1', 'A2', 'A3'], 
                    'B':['B0', 'B1', 'B2', 'B3'],
                    'C':['C0', 'C1', 'C2', 'C3'],
                    'D':['D0', 'D1', 'D2', 'D3']
                   }, index=[0, 1, 2, 3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [25]:
df2 = pd.DataFrame({'A':['A4', 'A5', 'A6', 'A7'],
                    'B':['B4', 'B5', 'B6', 'B7'],
                    'E':['C4', 'C5', 'C6', 'C7'],
                    'F':['D4', 'D5', 'D6', 'D7']
                   }, index=[0, 1, 2, 3])
df2

    A   B   E   F
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [26]:
df3 = pd.DataFrame({'A':['A8', 'A9', 'A10', 'A11'],
                    'B':['B8', 'B9', 'B10', 'B11'],
                    'C':['C8', 'C9', 'C10', 'C11'],
                    'G':['D8', 'D9', 'D10', 'D11']
                   }, index=[1, 2, 3, 4])
df3

     A    B    C    G
1   A8   B8   C8   D8
2   A9   B9   C9   D9
3  A10  B10  C10  D10
4  A11  B11  C11  D11

ConcateëŠ” ê¸°ë³¸ì ìœ¼ë¡œ outer joinì„ ìˆ˜í–‰í•œë‹¤.

In [27]:
pd.concat([df1, df2, df3])

     A    B    C    D    E    F    G
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN
0   A4   B4  NaN  NaN   C4   D4  NaN
1   A5   B5  NaN  NaN   C5   D5  NaN
2   A6   B6  NaN  NaN   C6   D6  NaN
3   A7   B7  NaN  NaN   C7   D7  NaN
1   A8   B8   C8  NaN  NaN  NaN   D8
2   A9   B9   C9  NaN  NaN  NaN   D9
3  A10  B10  C10  NaN  NaN  NaN  D10
4  A11  B11  C11  NaN  NaN  NaN  D11

In [28]:
pd.concat([df1, df2, df3], join='inner')

     A    B
0   A0   B0
1   A1   B1
2   A2   B2
3   A3   B3
0   A4   B4
1   A5   B5
2   A6   B6
3   A7   B7
1   A8   B8
2   A9   B9
3  A10  B10
4  A11  B11

keys íŒŒë¼ë¯¸í„°ë¥¼ í†µí•´ ìƒìœ„ ë ˆë²¨ì˜ ì¸ë±ìŠ¤ë¥¼ ìƒì„±í•  ìˆ˜ë„ ìˆë‹¤.

In [29]:
pd.concat([df1, df2, df3],keys=['x', 'y', 'z'])

       A    B    C    D    E    F    G
x 0   A0   B0   C0   D0  NaN  NaN  NaN
  1   A1   B1   C1   D1  NaN  NaN  NaN
  2   A2   B2   C2   D2  NaN  NaN  NaN
  3   A3   B3   C3   D3  NaN  NaN  NaN
y 0   A4   B4  NaN  NaN   C4   D4  NaN
  1   A5   B5  NaN  NaN   C5   D5  NaN
  2   A6   B6  NaN  NaN   C6   D6  NaN
  3   A7   B7  NaN  NaN   C7   D7  NaN
z 1   A8   B8   C8  NaN  NaN  NaN   D8
  2   A9   B9   C9  NaN  NaN  NaN   D9
  3  A10  B10  C10  NaN  NaN  NaN  D10
  4  A11  B11  C11  NaN  NaN  NaN  D11

ignore_index íŒŒë¼ë¯¸í„°ë¥¼ Trueë¡œ ì„¤ì •í•œë‹¤ë©´ ê¸°ì¡´ ì¸ë±ìŠ¤ë¥¼ ì œê±°í•˜ê³  0-base ì¸ë±ìŠ¤ë¡œ ìƒˆë¡­ê²Œ ì„¤ì •í•  ìˆ˜ ìˆë‹¤.

In [30]:
pd.concat([df1, df2, df3], join='inner', ignore_index=True)

      A    B
0    A0   B0
1    A1   B1
2    A2   B2
3    A3   B3
4    A4   B4
5    A5   B5
6    A6   B6
7    A7   B7
8    A8   B8
9    A9   B9
10  A10  B10
11  A11  B11

í–‰ ì¸ë±ìŠ¤ê°€ ì•„ë‹Œ ì—´ë¡œ Concate í•˜ë ¤ë©´ íŒŒë¼ë¯¸í„° axisë¥¼ 1ë¡œ ì„¤ì •í•˜ë©´ ëœë‹¤.

In [31]:
df1 = pd.DataFrame(
    np.arange(6).reshape(3,2),
    index=['a', 'b', 'c'],
    columns=['ë°ì´í„°1', 'ë°ì´í„°2'])
df1

   ë°ì´í„°1  ë°ì´í„°2
a     0     1
b     2     3
c     4     5

In [32]:
df2 = pd.DataFrame(
    5 + np.arange(4).reshape(2,2),
    index=['a', 'c'],
    columns=['ë°ì´í„°2', 'ë°ì´í„°4'])
df2

   ë°ì´í„°2  ë°ì´í„°4
a     5     6
c     7     8

In [33]:
pd.concat([df1, df2], axis=0)

   ë°ì´í„°1  ë°ì´í„°2  ë°ì´í„°4
a   0.0     1   NaN
b   2.0     3   NaN
c   4.0     5   NaN
a   NaN     5   6.0
c   NaN     7   8.0

In [34]:
pd.concat([df1, df2], axis=1)

   ë°ì´í„°1  ë°ì´í„°2  ë°ì´í„°2  ë°ì´í„°4
a     0     1   5.0   6.0
b     2     3   NaN   NaN
c     4     5   7.0   8.0

In [35]:
pd.concat([df1,df2], axis=1, join='inner')

   ë°ì´í„°1  ë°ì´í„°2  ë°ì´í„°2  ë°ì´í„°4
a     0     1     5     6
c     4     5     7     8